<?php

use Illuminate\Database\Seeder;

class CompetenceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('competences')->insert(['name' => 'Знание законов и инвых нормативных правовых актов в сфере охраны труда','code' => 'K-1',]);
        DB::table('competences')->insert(['name' => 'Способность организовывать и координировать работы по охране труда','code' => 'K-2',]);
        DB::table('competences')->insert(['name' => 'Способность осуществлять контроль за соблюдением работниками требований в области охраны труда','code' => 'K-3',]);
        DB::table('competences')->insert(['name' => 'Знание методов выявления и оценки опасностей, управления профессиональными рисками','code' => 'K-4',]);
        DB::table('competences')->insert(['name' => 'Умение своевременни определить потребность в обучении работников в области охраны труда, обеспечить организацию и контроль за проведением инструктажей работников по вопросам охраны труда','code' => 'K-5',]);
        DB::table('competences')->insert(['name' => 'Умение информировать и консультировать работников по вопросам состояния условий труда на рабочих местах, существующих профессиональных рисках','code' => 'K-6',]);
        DB::table('competences')->insert(['name' => 'Способность мотивировать (выстраивать систему мотивации) к безопасному выполнению работ','code' => 'K-7',]);
        DB::table('competences')->insert(['name' => 'Умение анализироватьс причины производственного трпвматизма и профессиональных заболеваний, принимать участие в их расследовании','code' => 'K-8',]);
        DB::table('competences')->insert(['name' => 'Способность анализировать состояние условий и охраны труда, давать предложения по их улучшению','code' => 'K-9',]);
        DB::table('competences')->insert(['name' => 'Способность оказывать методическую помощь руководителям структурных подразделений по вопросам охраны труда','code' => 'K-10',]);
        DB::table('competences')->insert(['name' => 'Способность разрабатывать локальные нормативные акты по охране труда','code' => 'K-11',]);
        DB::table('competences')->insert(['name' => 'Умение провести оценку эффективности мероприятий в области охраны труда','code' => 'K-12',]);
        DB::table('competences')->insert(['name' => 'Знание требований документооборота и отчетности по вопросам охраны труда','code' => 'K-13',]);
    }
}
